---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ElasticModulusStrongAxis
source: html/b0c6d43c-b0b3-abf3-6182-339b6e8eb957.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ElasticModulusStrongAxis Property

Elastic section modulus about main strong axis for calculation of bending stresses.

## Syntax (C#)
```csharp
public double ElasticModulusStrongAxis { get; set; }
```